'use strict'

const colors = ["red", "blue"]
const ver = ["照", "翻面", "攻擊", "逃離", "看", "甩", "撞擊", "組合", "打開", "離開", "留在"]
const oStory = {
    start: {
        text: '我收了鏡子，想道：“這道士倒有意思，我何不照一照試試。”想畢，拿起"風月鑒"來。一開始是鏡子反面（請拖移方塊來執行動作，同樣的動作可以重複執行）',
        add: ["我", "照", "風月鑑"],
        img: "風月鑒(模糊)"
    },
    我照風月鑑: {
        set: "story.flip|=0",
        check: "story.flip"
    },
    我照風月鑑0: {
        check: "(count>=2)+(count>=3)+(count>=10)"
    },
    我照風月鑑1: {
        check: "count-1"
    },
    我照風月鑑00: {
        text: '只見一個骷髏立在里面，唬得我連忙掩了，罵：“道士混帳，如何嚇我！-我倒再翻面看看正面是什麼。',
        add: ["翻面"],
        img: "風月鑒(骷髏)"
    },
    我照風月鑑01: {
        text: '雖然骷髏很恐怖，但我的身體好像好了一些'
    },
    我照風月鑑02: {
        text: '我的身體又好像好了一些'
    },
    我照風月鑑03: {
        text: '正如道士所言，我的身體越來越舒暢。也覺得骷髏越看其實也沒那麼可怕了，反而有種可愛的感覺。三日之期轉眼即逝，在歸還風月鑒並且向道士道謝了以後，我迅速向我最忠心的僕人詢問，城附近最近的墓地在哪裡。並帶著十個機靈的小夥子去盜了十幾具骷髏。那潔白的身體，光滑的手臂，細長的大腿，使我萬分的著迷.....',
        end: 1,
        img: "結局0"
    },
    我翻面風月鑑: {
        text: "我將鏡子翻了面",
        set: "story.flip^=1"
    },
    我照風月鑑10: {
        text: '我將正面一照，只見鳳姐站在里面招手叫我．心中一喜，蕩悠悠的覺得進了鏡子，與鳳姐雲雨一番，鳳姐仍送我出來．到了床上，哎喲了一聲，一睜眼，鏡子從手里掉過來，仍是反面立著一個骷髏．我自覺汗津津的，底下已遺了一灘精．',
        img: "風月鑒(鳳姐)"
    },
    我照風月鑑11: {
        text: '只見鳳姐還招手叫我，我又進去，我已經不想翻回反面了。',
        remove: ["翻面"]
    },
    我照風月鑑12: {
        text: '只見鳳姐還招手叫我，我又進去，完事後出來。'
    },
    我照風月鑑13: {
        text: '到了這次，剛要出鏡子來，只看見彷彿黑白無常兩個人走來作勢攻擊我，讓我心生畏懼想逃離。',
        add: ["黑白無常", "攻擊", "逃離", "看"],
        remove: ["風月鑑", "照"]
    },
    我看黑白無常: {
        text: '一高一矮，一白一黑的兩人，透露出陰森古怪的氣息。',
        img: "黑白無常(鐵鎖)"
    },
    我攻擊黑白無常: {
        check: "story.escaped|0"
    },
    我攻擊黑白無常0: {
        text: '他們如鬼魅般快速的衝過來，在我還無法反應前拿鐵鎖把我套住，拉了就走．我叫道：“讓我拿了鏡子再走。”-只說了這句，就再沒有印象了。…….……..過了許久，我醒來發現自己在一個異樣的空間，定睛一看竟是個牢籠!?',
        add: ["牢籠"],
        remove: ["黑白無常", "逃離", "攻擊"]
    },
    我逃離黑白無常: {
        check: "story.escaped|0"
    },
    我逃離黑白無常0: {
        other: "我攻擊黑白無常"
    },
    我看牢籠: {
        check: "count>=2|0",
        img: "牢籠"
    },
    我看牢籠0: {
        text: '四周一片的寂靜透露出一種陰森的感覺，還有陣陣的刺骨陰風從窗口吹進牢籠內，四周還散發著一股惡臭，地上還有一些又黑又滑的區塊不知是青苔還是甚麼物。我憑著從窗外灑進來的些許紅光的看了看四周的景物。看見了布滿鐵欄杆的小窗戶，窗戶底下的稻草堆，和一面鐵製的欄杆，在右邊三分之一的地方則是欄杆樣的門。手上的枷鎖緊緊禁錮了我的雙手，但這個枷鎖看起來有點老舊，外表都生鏽了一大片。',
        add: ["欄杆", "窗戶", "稻草堆", "枷鎖", "門"],
        remove: ["黑白無常", "逃離", "攻擊"]
    },
    我看牢籠1: {
        text: '四周的氛圍讓我一刻也不想再待下去。'
    },
    我看門: {
        check: "story.hasKey|0",
        img: "門"
    },
    我看門0: {
        text: '這個門有與欄杆用一個大鎖鎖住了。看來除了拿到鑰匙別無開門法。'
    },
    我看門1: {
        text: '拿到鑰匙了，看一下這把鑰匙符不符合門上的鎖。'
    },
    我看窗戶: {
        check: 'count>=2|0'
    },
    我看窗戶0: {
        text: '我跳起想看看窗外，竟看見了夜空中出現一顆大大的的紅色眼珠就在那一瞬間注視著我。我嚇了一大跳，使我落地時沒站穩向後滑倒，發出巨大的撞擊聲。花了一陣子平復我的痛覺和混亂的心情後，我更下定決心我一定要離開著個鬼地方。',
        add: ["撞擊"],
        img: "窗(眼球)"
    },
    我看窗戶1: {
        text: '奇怪，那個眼珠怎麼消失了?取而代之的是一個紅色的月亮，難道剛剛是我的錯覺?',
        img: "窗(月)"
    },
    我看枷鎖: {
        text: '這個枷鎖把我的手禁錮住了，讓我非常不方便。它看起來有點老舊，外表都生鏽了一大片，說不定我可以想辦法撞壞它'
    },
    我看壞掉的枷鎖: {
        text: '剛好這個被我破壞掉的半個鐵製枷鎖呈現鉤子狀，感覺可以為我所用。'
    },
    我看繩子: {
        text: '比起平常用的繩子差地遠了，不過應該算是勘用。'
    },
    我看耙子: {
        text: '又髒又舊的耙子，看來可以當作武器使用，只是稍嫌重了些。'
    },
    枷鎖撞擊欄杆: {
        check: 'count>=2|0'
    },
    枷鎖撞擊欄杆0: {
        text: '手上的枷鎖與鐵欄相撞發出清脆的聲響，枷鎖鬆了許多好像快被破壞了。'
    },
    枷鎖撞擊欄杆1: {
        text: '我將枷鎖徹底破壞了，我的雙手獲得的自由。咦?這個壞掉的枷鎖成鉤狀，感覺有其他用途。也許我可以組合出什麼',
        add: ["壞掉的枷鎖", "組合"],
        remove: ["枷鎖"],
    },
    枷鎖撞擊牢籠: {
        other: "枷鎖撞擊欄杆"
    },
    枷鎖撞擊門: {
        other: "枷鎖撞擊欄杆"
    },
    枷鎖撞擊窗戶: {
        text: "太高了撞不到..."
    },
    枷鎖撞擊耙子: {
        text: "耙子太輕了，力道不夠。也許我該拿枷鎖去撞其他東西"
    },
    耙子撞擊枷鎖: {
        other: "枷鎖撞擊耙子"
    },
    我看欄杆: {
        check: 'count>=2|0',
        img: "欄杆"
    },
    我看欄杆0: {
        text: ' 欄杆外有個人影，定睛一看那竟是個骷髏人!? 那具骷髏背對著牢房佇立著，彷彿無法感知所有事情一般一動也不動。',
        add: ["骷髏"]
    },
    我看欄杆1: {
        text: ' 除了骷髏人，其他的一切我都看不清楚。'
    },
    我看骷髏: {
        check: 'count>=2|0',
        img: "骷髏"
    },
    我看骷髏0: {
        text: '我往前更仔細的看了一下，發現他的腰間好像掛著一副鑰匙。忽然，骷髏的嘴巴忽然不開合發出咖咖咖的聲音害我嚇了一大跳，這個骷髏竟然會動!?',
        set: "story.seenSke=1"
    },
    我看骷髏1: {
        text: '骷髏依舊佇立在那發出嘈雜的咖咖聲。'
    },
    我看稻草堆: {
        check: '(count>=2)+(count>=3)',
        img: "稻草堆"
    },
    我看稻草堆0: {
        text: '這裡有一堆稻草，還記得小時候看見窮人家的小孩會將稻草組合成的線，玩一個好像叫"繩飛"的遊戲，雖然是貧民的娛樂卻令我好生羨慕。等等，稻草堆裡好像有東西。'
    },
    我看稻草堆1: {
        text: '原來稻草堆裡有耙子，大概是哪個粗心的守衛忘在這的吧。',
        add: ["耙子"],
        set: "story.canHit=1",
        img: "稻草堆(耙子)"
    },
    我看稻草堆2: {
        text: '一堆充滿溼氣的稻草堆，我一點都都不想躺上去。我也許能用它編出什麼來...',
    },
    我組合稻草堆: {
        check: 'story.canHit|0'
    },
    我組合稻草堆0: {
        text: '裡面好像有什麼東西，我需要先看一下。'
    },
    我組合稻草堆1: {
        text: '雖然沒有實際做過，不過嘗試了一陣子還是勉強編出一條算是繩子的東西。',
        add: ["繩子"],
        remove: ["稻草堆"]
    },
    壞掉的枷鎖組合繩子: {
        text: '我用繩子綁住鉤狀壞掉的枷鎖的一端，變成了一個甩鉤，將它甩出去可以讓我拿到手原本拿不到的東西。',
        add: ["甩", "甩鉤"],
        remove: ["壞掉的枷鎖", "繩子"]
    },
    繩子組合壞掉的枷鎖: {
        other: "壞掉的枷鎖組合繩子"
    },
    耙子撞擊骷髏: {
        check: 'story.seenSke|0'
    },
    耙子撞擊骷髏0: {
        text: '它只是個不會動的普通骷髏，雖然有點嚇人但沒有打它的必要。'
    },
    耙子撞擊骷髏1: {
        text: '我用耙子的往骷髏的頭由上而下的揮下去，想步道骷髏這麼不堪一擊的瞬間散成一堆骨頭，終於不用再聽到他煩人的噪音了。我看到落在外的鑰匙在骨頭上。',
        add: ["門外的鑰匙"],
        remove: ["骷髏"]
    },
    耙子撞擊門: {
        text: '我用盡全力用耙子敲了門，反擊力之大讓我差點脫手。看來只能用別種方法開門了。'
    },
    耙子撞擊稻草堆: {
        text: ' (用耙子好好整理了稻草堆一番。)'
    },
    耙子撞擊欄杆: {
        text: '我盡力用耙子撞擊門，金屬的撞擊聲震耳欲聾，但欄杆毫無異狀，我的耙子卻歪了，很明顯這鐵製欄杆跟門比耙子堅硬很多。'
    },
    耙子撞擊窗戶: {
        text: '我試圖用耙子破壞窗戶，窗戶的欄杆太緊密了，險些讓耙子卡住。'
    },
    耙子撞擊牢籠: {
        text: '響徹的聲音迴盪在這間牢籠裡，我得到了一個結論。要嗎就是周圍沒有守衛，要嘛守衛都是聾子。'
    },
    我撞擊窗戶: {
        text: '窗戶太高了，我連碰都碰不到。'
    },
    我撞擊門: {
        set: 'story.dm|=0',
        check: '(++story.dm>=3)+(story.dm>=5)'
    },
    我撞擊門0: {
        text: '痛死我了，我為何要這樣做？'
    },
    我撞擊門1: {
        text: '我感覺到自己的全身多了一條一條的瘀血，我覺得我快撐不住了...'
    },
    我撞擊門2: {
        text: '我已經放棄離開這裡了，怎麼嘗試都是白費功夫。在這恐怖的氛圍下我終於失去理智，也許在這種時候，死亡對我來說是唯一解脫...',
        end: -1,
        img: '精神崩潰'
    },
    我撞擊欄杆: {
        other: '我撞擊門'
    },
    我撞擊牢籠: {
        other: '我撞擊門'
    },
    我撞擊耙子: {
        other: '我撞擊門'
    },
    耙子撞擊我: {
        other: '我撞擊門'
    },
    我看門外的鑰匙: {
        text: '鑰匙太遠了拿不到，我需要工具來幫忙。',
    },
    甩鉤甩門外的鑰匙: {
        text: '經過一些嘗試，我順利鉤中了鑰匙，將它從鉤上拿了下來。',
        add: ["鑰匙"],
        remove: ["甩", "甩鉤", "門外的鑰匙"]
    },
    甩鉤甩骷髏: {
        check: 'story.seenSke|0'
    },
    甩鉤甩骷髏0: {
        check: '我將甩鉤甩到骷髏身上並鉤到其中一塊骨頭，但我用盡全力竟然拉不動它!?只好想辦法把甩鉤收回了。'
    },
    甩鉤甩骷髏1: {
        check: '我覺得用甩鉤是沒辦法對這個骷髏造成多大的傷害的，可能要用更強力的東西...'
    },
    甩鉤甩窗戶: {
        text: '我用甩鉤爬上窗口發現這窗真的太小了，就算我成功破壞上面的所有欄杆我也出不去。'
    },
    甩鉤甩門: {
        text: '鉤到門了，然後......發現好像沒甚麼意義。'
    },
    我看鑰匙: {
        check: 'count>=2|0'
    },
    我看鑰匙0: {
        text: '這個應該就是這門的鑰匙，來試試看能不能打開門的鎖吧。',
        add: ["打開"]
    },
    我看鑰匙1: {
        text: '這個就是這門的鑰匙，來試試看能不能打開門的鎖吧。',
    },
    我打開門: {
        text: '想不到我一個貴公子在危機的時候經然還保持鎮定與機靈，順利逃離了那個牢籠，也不忘了帶著耙子防身。就在踏出門的一剎那，我看見我親愛的鳳姐正向我招來，我自然跟了過去。鳳姐沒說話，臉上維持著嬌媚的笑容，竟然足不沾地的移動。不過是我最愛的鳳姐，我當然追隨。在經過一個岔路口時，那黑白無常出現在路前擋住我們的其中一條路且用驚訝並憤怒的眼神看著我們，鳳姐一看到就像隻小貓似的迅速地躲在了我的身後緊靠著我的背。鳳姐說:"賈瑞~我怕..."，並小聲地說:"我知道一個密道可以通往我的房間逃離他們的追殺，就在那邊"。鳳姐向另外一個方向指了指。但我心想，若現在我能夠展現男子漢的氣魄將黑白無常擊退，鳳姐一定會對我佩服的五體投地，且死心踏地的愛我。我應該怎麼做呢?',
        add: ["逃離", "攻擊", "黑白無常"],
        remove: ["看", "撞擊", "組合", "牢籠", "欄杆", "窗戶", "鑰匙", "門", "打開", "耙子"],
        set: "story.escaped=1",
        img: "黑白無常"
    },
    鑰匙打開門: {
        other: "我打開門"
    },
    我攻擊黑白無常1: {
        text: '我用堅定的聲音向鳳姐說: "鳳姐不用怕，有我賈瑞在，定保你不背傷及一根寒毛。"隨即拿起耙子衝向前去，一招橫掃千軍向他們揮過去。 ……. 奇怪!?怎麼穿透過去了!?!?!? 在我還無法反應前黑白無常就再次拿鐵鎖把套住了我的脖子，我怒力掙扎監聽到: "好大的膽子!膽敢攻擊鬼差!本來想閻王念在你非大罪之人只是受困於私慾想從輕發落，看來沒有這個需要了。"我的意識越來越模糊，想向鳳姐求救才發現她竟然消失了。再見了世界...希望沒有人記得我一個這麼愚蠢的人。',
        end: 2,
        img: "結局1"
    },
    我逃離黑白無常1: {
        text: '我們快速地衝向鳳姐指的方向，想不到一晃眼間，竟到了之前跟鳳姐翻雲覆雨的那個房間，這是甚麼仙術嗎?鳳姐對我說:"那就是你進來的那面鏡子，但我希望你能留在這陪我，我保證給你所有你想要的一切好嗎?"她用她水靈的兩顆大眼睛看著我，讓我實在難以離開她，但我也清楚這個鳳姐不是真實的......',
        add: ["離開", "留在", "鏡子"],
        remove: ["逃離", "攻擊", "黑白無常"]
    },
    我留在鏡子: {
        text: '我決定留在鏡子裡與鳳姐...相思到天荒地老... (賈瑞的家) 一個聲音在早晨劃過天際 : 老爺不好了!!少爺他...沒氣了!! 賈瑞的身體彷彿被吸乾一般倒在床上，床榻上滿是遺精，量多到滴到了地板上...',
        end: 3,
        img: "結局3"
    },
    我離開鏡子: {
        text: '在鏡中一會兒，外面已經過了數百年。想不到今天的光景跟之前是多麼的不同啊。女孩各個美女如花，勝過我的鳳姐數十倍，這下可困擾了，得好好挑一個娶回家當老婆才是啊。 為了將我的奇幻故事保存下來，我拜訪許許多多的作家、漫畫家等等，希望能把我奇妙的一生公諸於世，可惜沒有半個人相信我說的話，只以為我是個神經病。 直到我遇見這幾位 俊俏無比、潘安再世、一表人才、玉樹臨風、風姿瀟灑 的公子們.......',
        end: 4
    }
}
var story
var talkCount = 0

function changeText(s, i, c) {
    if (c != talkCount || i >= s.length) return
    $("#text").html($("#text").html() + s[i])

    setTimeout(() => changeText(s, i + 1, c), 50)
}

function setImg(s) {
    s = "img/" + s + ".png"
    $("#img").attr("src", s)

    img.onload = () => $("#img").css("left", (mapW / 2 - img.width / 2) + "px")
}

function action(s) {
    if (!story[s]) return

    let o = story[s]

    if (o.set) {
        eval(o.set)
    }

    if (o.img) {
        setImg(o.img)
    }

    if (o.check) {
        o.count = o.count ? o.count + 1 : 1
        action(s + eval(o.check.replace(/count/g, o.count)))
        return
    }

    if (o.other) {
        action(o.other)
        return
    }

    $("#text").html("")
    changeText((o.end ? "(結局#" + o.end + ") " : "") + o.text, 0, ++talkCount)

    if (o.add) {
        o.add.forEach(e => {
            add(e, colors[ver.includes(e) | 0])
        });
    }

    if (o.remove) {
        o.remove.forEach(e => {
            remove(e)
        });
    }

    if (o.end) {
        state = 2
        blockList.length = 0
        setTimeout(() => blockList.push(new block(mapW / 2, mapH - talk_height, "回主畫面", "red")), 1000)

        select = null
        size = 0
        for (let i = 0; i < 3; i++)
            slot[i] = null

        update()
    }
}